arduino/Arduino/hardware/msp432/cores/msp432/driverlib/rom_map.h
/*
 * -------------------------------------------
 *    MSP432 DriverLib - v3_10_00_09 
 * -------------------------------------------
 *
 * --COPYRIGHT--,BSD,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// rom_map.h - Macros to facilitate calling functions in the ROM when they are
//             available and in flash otherwise.
//
// Copyright (c) 2013 Texas Instruments Incorporated.  All rights reserved.
// TI Information - Selective Disclosure
//
//
//*****************************************************************************

#ifndef __ROM_MAP_H__
#define __ROM_MAP_H__

//*****************************************************************************
//
// Macros for the ADC14 API.
//
//*****************************************************************************
#ifdef ROM_ADC14_enableModule
#define MAP_ADC14_enableModule                                                \
        ROM_ADC14_enableModule
#else
#define MAP_ADC14_enableModule                                                \
        ADC14_enableModule
#endif
#ifdef ROM_ADC14_disableModule
#define MAP_ADC14_disableModule                                               \
        ROM_ADC14_disableModule
#else
#define MAP_ADC14_disableModule                                               \
        ADC14_disableModule
#endif
#ifdef ROM_ADC14_initModule
#define MAP_ADC14_initModule                                                  \
        ROM_ADC14_initModule
#else
#define MAP_ADC14_initModule                                                  \
        ADC14_initModule
#endif
#ifdef ROM_ADC14_setResolution
#define MAP_ADC14_setResolution                                               \
        ROM_ADC14_setResolution
#else
#define MAP_ADC14_setResolution                                               \
        ADC14_setResolution
#endif
#ifdef ROM_ADC14_getResolution
#define MAP_ADC14_getResolution                                               \
        ROM_ADC14_getResolution
#else
#define MAP_ADC14_getResolution                                               \
        ADC14_getResolution
#endif
#ifdef ROM_ADC14_setSampleHoldTrigger
#define MAP_ADC14_setSampleHoldTrigger                                        \
        ROM_ADC14_setSampleHoldTrigger
#else
#define MAP_ADC14_setSampleHoldTrigger                                        \
        ADC14_setSampleHoldTrigger
#endif
#ifdef ROM_ADC14_setSampleHoldTime
#define MAP_ADC14_setSampleHoldTime                                           \
        ROM_ADC14_setSampleHoldTime
#else
#define MAP_ADC14_setSampleHoldTime                                           \
        ADC14_setSampleHoldTime
#endif
#ifdef ROM_ADC14_configureMultiSequenceMode
#define MAP_ADC14_configureMultiSequenceMode                                  \
        ROM_ADC14_configureMultiSequenceMode
#else
#define MAP_ADC14_configureMultiSequenceMode                                  \
        ADC14_configureMultiSequenceMode
#endif
#ifdef ROM_ADC14_configureSingleSampleMode
#define MAP_ADC14_configureSingleSampleMode                                   \
        ROM_ADC14_configureSingleSampleMode
#else
#define MAP_ADC14_configureSingleSampleMode                                   \
        ADC14_configureSingleSampleMode
#endif
#ifdef ROM_ADC14_enableConversion
#define MAP_ADC14_enableConversion                                            \
        ROM_ADC14_enableConversion
#else
#define MAP_ADC14_enableConversion                                            \
        ADC14_enableConversion
#endif
#ifdef ROM_ADC14_disableConversion
#define MAP_ADC14_disableConversion                                           \
        ROM_ADC14_disableConversion
#else
#define MAP_ADC14_disableConversion                                           \
        ADC14_disableConversion
#endif
#ifdef ROM_ADC14_isBusy
#define MAP_ADC14_isBusy                                                      \
        ROM_ADC14_isBusy
#else
#define MAP_ADC14_isBusy                                                      \
        ADC14_isBusy
#endif
#ifdef ROM_ADC14_configureConversionMemory
#define MAP_ADC14_configureConversionMemory                                   \
        ROM_ADC14_configureConversionMemory
#else
#define MAP_ADC14_configureConversionMemory                                   \
        ADC14_configureConversionMemory
#endif
#ifdef ROM_ADC14_enableComparatorWindow
#define MAP_ADC14_enableComparatorWindow                                      \
        ROM_ADC14_enableComparatorWindow
#else
#define MAP_ADC14_enableComparatorWindow                                      \
        ADC14_enableComparatorWindow
#endif
#ifdef ROM_ADC14_disableComparatorWindow
#define MAP_ADC14_disableComparatorWindow                                     \
        ROM_ADC14_disableComparatorWindow
#else
#define MAP_ADC14_disableComparatorWindow                                     \
        ADC14_disableComparatorWindow
#endif
#ifdef ROM_ADC14_setComparatorWindowValue
#define MAP_ADC14_setComparatorWindowValue                                    \
        ROM_ADC14_setComparatorWindowValue
#else
#define MAP_ADC14_setComparatorWindowValue                                    \
        ADC14_setComparatorWindowValue
#endif
#ifdef ROM_ADC14_setResultFormat
#define MAP_ADC14_setResultFormat                                             \
        ROM_ADC14_setResultFormat
#else
#define MAP_ADC14_setResultFormat                                             \
        ADC14_setResultFormat
#endif
#ifdef ROM_ADC14_getResult
#define MAP_ADC14_getResult                                                   \
        ROM_ADC14_getResult
#else
#define MAP_ADC14_getResult                                                   \
        ADC14_getResult
#endif
#ifdef ROM_ADC14_getMultiSequenceResult
#define MAP_ADC14_getMultiSequenceResult                                      \
        ROM_ADC14_getMultiSequenceResult
#else
#define MAP_ADC14_getMultiSequenceResult                                      \
        ADC14_getMultiSequenceResult
#endif
#ifdef ROM_ADC14_getResultArray
#define MAP_ADC14_getResultArray                                              \
        ROM_ADC14_getResultArray
#else
#define MAP_ADC14_getResultArray                                              \
        ADC14_getResultArray
#endif
#ifdef ROM_ADC14_enableReferenceBurst
#define MAP_ADC14_enableReferenceBurst                                        \
        ROM_ADC14_enableReferenceBurst
#else
#define MAP_ADC14_enableReferenceBurst                                        \
        ADC14_enableReferenceBurst
#endif
#ifdef ROM_ADC14_disableReferenceBurst
#define MAP_ADC14_disableReferenceBurst                                       \
        ROM_ADC14_disableReferenceBurst
#else
#define MAP_ADC14_disableReferenceBurst                                       \
        ADC14_disableReferenceBurst
#endif
#ifdef ROM_ADC14_setPowerMode
#define MAP_ADC14_setPowerMode                                                \
        ROM_ADC14_setPowerMode
#else
#define MAP_ADC14_setPowerMode                                                \
        ADC14_setPowerMode
#endif
#ifdef ROM_ADC14_enableInterrupt
#define MAP_ADC14_enableInterrupt                                             \
        ROM_ADC14_enableInterrupt
#else
#define MAP_ADC14_enableInterrupt                                             \
        ADC14_enableInterrupt
#endif
#ifdef ROM_ADC14_disableInterrupt
#define MAP_ADC14_disableInterrupt                                            \
        ROM_ADC14_disableInterrupt
#else
#define MAP_ADC14_disableInterrupt                                            \
        ADC14_disableInterrupt
#endif
#ifdef ROM_ADC14_getInterruptStatus
#define MAP_ADC14_getInterruptStatus                                          \
        ROM_ADC14_getInterruptStatus
#else
#define MAP_ADC14_getInterruptStatus                                          \
        ADC14_getInterruptStatus
#endif
#ifdef ROM_ADC14_getEnabledInterruptStatus
#define MAP_ADC14_getEnabledInterruptStatus                                   \
        ROM_ADC14_getEnabledInterruptStatus
#else
#define MAP_ADC14_getEnabledInterruptStatus                                   \
        ADC14_getEnabledInterruptStatus
#endif
#ifdef ROM_ADC14_clearInterruptFlag
#define MAP_ADC14_clearInterruptFlag                                          \
        ROM_ADC14_clearInterruptFlag
#else
#define MAP_ADC14_clearInterruptFlag                                          \
        ADC14_clearInterruptFlag
#endif
#ifdef ROM_ADC14_toggleConversionTrigger
#define MAP_ADC14_toggleConversionTrigger                                     \
        ROM_ADC14_toggleConversionTrigger
#else
#define MAP_ADC14_toggleConversionTrigger                                     \
        ADC14_toggleConversionTrigger
#endif
#ifdef ROM_ADC14_enableSampleTimer
#define MAP_ADC14_enableSampleTimer                                           \
        ROM_ADC14_enableSampleTimer
#else
#define MAP_ADC14_enableSampleTimer                                           \
        ADC14_enableSampleTimer
#endif
#ifdef ROM_ADC14_disableSampleTimer
#define MAP_ADC14_disableSampleTimer                                          \
        ROM_ADC14_disableSampleTimer
#else
#define MAP_ADC14_disableSampleTimer                                          \
        ADC14_disableSampleTimer
#endif
#ifdef ROM_ADC14_registerInterrupt
#define MAP_ADC14_registerInterrupt                                           \
        ROM_ADC14_registerInterrupt
#else
#define MAP_ADC14_registerInterrupt                                           \
        ADC14_registerInterrupt
#endif
#ifdef ROM_ADC14_unregisterInterrupt
#define MAP_ADC14_unregisterInterrupt                                         \
        ROM_ADC14_unregisterInterrupt
#else
#define MAP_ADC14_unregisterInterrupt                                         \
        ADC14_unregisterInterrupt
#endif

//*****************************************************************************
//
// Macros for the AES256 API.
//
//*****************************************************************************
#ifdef ROM_AES256_setCipherKey
#define MAP_AES256_setCipherKey                                               \
        ROM_AES256_setCipherKey
#else
#define MAP_AES256_setCipherKey                                               \
        AES256_setCipherKey
#endif
#ifdef ROM_AES256_encryptData
#define MAP_AES256_encryptData                                                \
        ROM_AES256_encryptData
#else
#define MAP_AES256_encryptData                                                \
        AES256_encryptData
#endif
#ifdef ROM_AES256_decryptData
#define MAP_AES256_decryptData                                                \
        ROM_AES256_decryptData
#else
#define MAP_AES256_decryptData                                                \
        AES256_decryptData
#endif
#ifdef ROM_AES256_setDecipherKey
#define MAP_AES256_setDecipherKey                                             \
        ROM_AES256_setDecipherKey
#else
#define MAP_AES256_setDecipherKey                                             \
        AES256_setDecipherKey
#endif
#ifdef ROM_AES256_reset
#define MAP_AES256_reset                                                      \
        ROM_AES256_reset
#else
#define MAP_AES256_reset                                                      \
        AES256_reset
#endif
#ifdef ROM_AES256_startEncryptData
#define MAP_AES256_startEncryptData                                           \
        ROM_AES256_startEncryptData
#else
#define MAP_AES256_startEncryptData                                           \
        AES256_startEncryptData
#endif
#ifdef ROM_AES256_startDecryptData
#define MAP_AES256_startDecryptData                                           \
        ROM_AES256_startDecryptData
#else
#define MAP_AES256_startDecryptData                                           \
        AES256_startDecryptData
#endif
#ifdef ROM_AES256_startSetDecipherKey
#define MAP_AES256_startSetDecipherKey                                        \
        ROM_AES256_startSetDecipherKey
#else
#define MAP_AES256_startSetDecipherKey                                        \
        AES256_startSetDecipherKey
#endif
#ifdef ROM_AES256_getDataOut
#define MAP_AES256_getDataOut                                                 \
        ROM_AES256_getDataOut
#else
#define MAP_AES256_getDataOut                                                 \
        AES256_getDataOut
#endif
#ifdef ROM_AES256_isBusy
#define MAP_AES256_isBusy                                                     \
        ROM_AES256_isBusy
#else
#define MAP_AES256_isBusy                                                     \
        AES256_isBusy
#endif
#ifdef ROM_AES256_clearErrorFlag
#define MAP_AES256_clearErrorFlag                                             \
        ROM_AES256_clearErrorFlag
#else
#define MAP_AES256_clearErrorFlag                                             \
        AES256_clearErrorFlag
#endif
#ifdef ROM_AES256_getErrorFlagStatus
#define MAP_AES256_getErrorFlagStatus                                         \
        ROM_AES256_getErrorFlagStatus
#else
#define MAP_AES256_getErrorFlagStatus                                         \
        AES256_getErrorFlagStatus
#endif
#ifdef ROM_AES256_clearInterruptFlag
#define MAP_AES256_clearInterruptFlag                                         \
        ROM_AES256_clearInterruptFlag
#else
#define MAP_AES256_clearInterruptFlag                                         \
        AES256_clearInterruptFlag
#endif
#ifdef ROM_AES256_getInterruptStatus
#define MAP_AES256_getInterruptStatus                                         \
        ROM_AES256_getInterruptStatus
#else
#define MAP_AES256_getInterruptStatus                                         \
        AES256_getInterruptStatus
#endif
#ifdef ROM_AES256_enableInterrupt
#define MAP_AES256_enableInterrupt                                            \
        ROM_AES256_enableInterrupt
#else
#define MAP_AES256_enableInterrupt                                            \
        AES256_enableInterrupt
#endif
#ifdef ROM_AES256_disableInterrupt
#define MAP_AES256_disableInterrupt                                           \
        ROM_AES256_disableInterrupt
#else
#define MAP_AES256_disableInterrupt                                           \
        AES256_disableInterrupt
#endif
#ifdef ROM_AES256_registerInterrupt
#define MAP_AES256_registerInterrupt                                          \
        ROM_AES256_registerInterrupt
#else
#define MAP_AES256_registerInterrupt                                          \
        AES256_registerInterrupt
#endif
#ifdef ROM_AES256_unregisterInterrupt
#define MAP_AES256_unregisterInterrupt                                        \
        ROM_AES256_unregisterInterrupt
#else
#define MAP_AES256_unregisterInterrupt                                        \
        AES256_unregisterInterrupt
#endif
#ifdef ROM_AES256_getInterruptFlagStatus
#define MAP_AES256_getInterruptFlagStatus                                     \
        ROM_AES256_getInterruptFlagStatus
#else
#define MAP_AES256_getInterruptFlagStatus                                     \
        AES256_getInterruptFlagStatus
#endif

//*****************************************************************************
//
// Macros for the Comp API.
//
//*****************************************************************************
#ifdef ROM_COMP_E_initModule
#define MAP_COMP_E_initModule                                                 \
        ROM_COMP_E_initModule
#else
#define MAP_COMP_E_initModule                                                 \
        COMP_E_initModule
#endif
#ifdef ROM_COMP_E_setReferenceVoltage
#define MAP_COMP_E_setReferenceVoltage                                        \
        ROM_COMP_E_setReferenceVoltage
#else
#define MAP_COMP_E_setReferenceVoltage                                        \
        COMP_E_setReferenceVoltage
#endif
#ifdef ROM_COMP_E_setReferenceAccuracy
#define MAP_COMP_E_setReferenceAccuracy                                       \
        ROM_COMP_E_setReferenceAccuracy
#else
#define MAP_COMP_E_setReferenceAccuracy                                       \
        COMP_E_setReferenceAccuracy
#endif
#ifdef ROM_COMP_E_setPowerMode
#define MAP_COMP_E_setPowerMode                                               \
        ROM_COMP_E_setPowerMode
#else
#define MAP_COMP_E_setPowerMode                                               \
        COMP_E_setPowerMode
#endif
#ifdef ROM_COMP_E_enableModule
#define MAP_COMP_E_enableModule                                               \
        ROM_COMP_E_enableModule
#else
#define MAP_COMP_E_enableModule                                               \
        COMP_E_enableModule
#endif
#ifdef ROM_COMP_E_disableModule
#define MAP_COMP_E_disableModule                                              \
        ROM_COMP_E_disableModule
#else
#define MAP_COMP_E_disableModule                                              \
        COMP_E_disableModule
#endif
#ifdef ROM_COMP_E_shortInputs
#define MAP_COMP_E_shortInputs                                                \
        ROM_COMP_E_shortInputs
#else
#define MAP_COMP_E_shortInputs                                                \
        COMP_E_shortInputs
#endif
#ifdef ROM_COMP_E_unshortInputs
#define MAP_COMP_E_unshortInputs                                              \
        ROM_COMP_E_unshortInputs
#else
#define MAP_COMP_E_unshortInputs                                              \
        COMP_E_unshortInputs
#endif
#ifdef ROM_COMP_E_disableInputBuffer
#define MAP_COMP_E_disableInputBuffer                                         \
        ROM_COMP_E_disableInputBuffer
#else
#define MAP_COMP_E_disableInputBuffer                                         \
        COMP_E_disableInputBuffer
#endif
#ifdef ROM_COMP_E_enableInputBuffer
#define MAP_COMP_E_enableInputBuffer                                          \
        ROM_COMP_E_enableInputBuffer
#else
#define MAP_COMP_E_enableInputBuffer                                          \
        COMP_E_enableInputBuffer
#endif
#ifdef ROM_COMP_E_swapIO
#define MAP_COMP_E_swapIO                                                     \
        ROM_COMP_E_swapIO
#else
#define MAP_COMP_E_swapIO                                                     \
        COMP_E_swapIO
#endif
#ifdef ROM_COMP_E_outputValue
#define MAP_COMP_E_outputValue                                                \
        ROM_COMP_E_outputValue
#else
#define MAP_COMP_E_outputValue                                                \
        COMP_E_outputValue
#endif
#ifdef ROM_COMP_E_enableInterrupt
#define MAP_COMP_E_enableInterrupt                                            \
        ROM_COMP_E_enableInterrupt
#else
#define MAP_COMP_E_enableInterrupt                                            \
        COMP_E_enableInterrupt
#endif
#ifdef ROM_COMP_E_disableInterrupt
#define MAP_COMP_E_disableInterrupt                                           \
        ROM_COMP_E_disableInterrupt
#else
#define MAP_COMP_E_disableInterrupt                                           \
        COMP_E_disableInterrupt
#endif
#ifdef ROM_COMP_E_clearInterruptFlag
#define MAP_COMP_E_clearInterruptFlag                                         \
        ROM_COMP_E_clearInterruptFlag
#else
#define MAP_COMP_E_clearInterruptFlag                                         \
        COMP_E_clearInterruptFlag
#endif
#ifdef ROM_COMP_E_getInterruptStatus
#define MAP_COMP_E_getInterruptStatus                                         \
        ROM_COMP_E_getInterruptStatus
#else
#define MAP_COMP_E_getInterruptStatus                                         \
        COMP_E_getInterruptStatus
#endif
#ifdef ROM_COMP_E_getEnabledInterruptStatus
#define MAP_COMP_E_getEnabledInterruptStatus                                  \
        ROM_COMP_E_getEnabledInterruptStatus
#else
#define MAP_COMP_E_getEnabledInterruptStatus                                  \
        COMP_E_getEnabledInterruptStatus
#endif
#ifdef ROM_COMP_E_setInterruptEdgeDirection
#define MAP_COMP_E_setInterruptEdgeDirection                                  \
        ROM_COMP_E_setInterruptEdgeDirection
#else
#define MAP_COMP_E_setInterruptEdgeDirection                                  \
        COMP_E_setInterruptEdgeDirection
#endif
#ifdef ROM_COMP_E_toggleInterruptEdgeDirection
#define MAP_COMP_E_toggleInterruptEdgeDirection                               \
        ROM_COMP_E_toggleInterruptEdgeDirection
#else
#define MAP_COMP_E_toggleInterruptEdgeDirection                               \
        COMP_E_toggleInterruptEdgeDirection
#endif
#ifdef ROM_COMP_E_registerInterrupt
#define MAP_COMP_E_registerInterrupt                                          \
        ROM_COMP_E_registerInterrupt
#else
#define MAP_COMP_E_registerInterrupt                                          \
        COMP_E_registerInterrupt
#endif
#ifdef ROM_COMP_E_unregisterInterrupt
#define MAP_COMP_E_unregisterInterrupt                                        \
        ROM_COMP_E_unregisterInterrupt
#else
#define MAP_COMP_E_unregisterInterrupt                                        \
        COMP_E_unregisterInterrupt
#endif

