arduino/Arduino/hardware/msp432/cores/msp432/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the CRC32 API.
//
//*****************************************************************************
#ifdef ROM_CRC32_setSeed
#define MAP_CRC32_setSeed                                                     \
        ROM_CRC32_setSeed
#else
#define MAP_CRC32_setSeed                                                     \
        CRC32_setSeed
#endif
#ifdef ROM_CRC32_set8BitData
#define MAP_CRC32_set8BitData                                                 \
        ROM_CRC32_set8BitData
#else
#define MAP_CRC32_set8BitData                                                 \
        CRC32_set8BitData
#endif
#ifdef ROM_CRC32_set16BitData
#define MAP_CRC32_set16BitData                                                \
        ROM_CRC32_set16BitData
#else
#define MAP_CRC32_set16BitData                                                \
        CRC32_set16BitData
#endif
#ifdef ROM_CRC32_set32BitData
#define MAP_CRC32_set32BitData                                                \
        ROM_CRC32_set32BitData
#else
#define MAP_CRC32_set32BitData                                                \
        CRC32_set32BitData
#endif
#ifdef ROM_CRC32_set8BitDataReversed
#define MAP_CRC32_set8BitDataReversed                                         \
        ROM_CRC32_set8BitDataReversed
#else
#define MAP_CRC32_set8BitDataReversed                                         \
        CRC32_set8BitDataReversed
#endif
#ifdef ROM_CRC32_set16BitDataReversed
#define MAP_CRC32_set16BitDataReversed                                        \
        ROM_CRC32_set16BitDataReversed
#else
#define MAP_CRC32_set16BitDataReversed                                        \
        CRC32_set16BitDataReversed
#endif
#ifdef ROM_CRC32_set32BitDataReversed
#define MAP_CRC32_set32BitDataReversed                                        \
        ROM_CRC32_set32BitDataReversed
#else
#define MAP_CRC32_set32BitDataReversed                                        \
        CRC32_set32BitDataReversed
#endif
#ifdef ROM_CRC32_getResult
#define MAP_CRC32_getResult                                                   \
        ROM_CRC32_getResult
#else
#define MAP_CRC32_getResult                                                   \
        CRC32_getResult
#endif
#ifdef ROM_CRC32_getResultReversed
#define MAP_CRC32_getResultReversed                                           \
        ROM_CRC32_getResultReversed
#else
#define MAP_CRC32_getResultReversed                                           \
        CRC32_getResultReversed
#endif

//*****************************************************************************
//
// Macros for the CS API.
//
//*****************************************************************************
#ifdef ROM_CS_initClockSignal
#define MAP_CS_initClockSignal                                                \
        ROM_CS_initClockSignal
#else
#define MAP_CS_initClockSignal                                                \
        CS_initClockSignal
#endif
#ifdef ROM_CS_setReferenceOscillatorFrequency
#define MAP_CS_setReferenceOscillatorFrequency                                \
        ROM_CS_setReferenceOscillatorFrequency
#else
#define MAP_CS_setReferenceOscillatorFrequency                                \
        CS_setReferenceOscillatorFrequency
#endif
#ifdef ROM_CS_enableClockRequest
#define MAP_CS_enableClockRequest                                             \
        ROM_CS_enableClockRequest
#else
#define MAP_CS_enableClockRequest                                             \
        CS_enableClockRequest
#endif
#ifdef ROM_CS_disableClockRequest
#define MAP_CS_disableClockRequest                                            \
        ROM_CS_disableClockRequest
#else
#define MAP_CS_disableClockRequest                                            \
        CS_disableClockRequest
#endif
#ifdef ROM_CS_setDCOCenteredFrequency
#define MAP_CS_setDCOCenteredFrequency                                        \
        ROM_CS_setDCOCenteredFrequency
#else
#define MAP_CS_setDCOCenteredFrequency                                        \
        CS_setDCOCenteredFrequency
#endif
#ifdef ROM_CS_tuneDCOFrequency
#define MAP_CS_tuneDCOFrequency                                               \
        ROM_CS_tuneDCOFrequency
#else
#define MAP_CS_tuneDCOFrequency                                               \
        CS_tuneDCOFrequency
#endif
#ifdef ROM_CS_enableDCOExternalResistor
#define MAP_CS_enableDCOExternalResistor                                      \
        ROM_CS_enableDCOExternalResistor
#else
#define MAP_CS_enableDCOExternalResistor                                      \
        CS_enableDCOExternalResistor
#endif
#ifdef ROM_CS_disableDCOExternalResistor
#define MAP_CS_disableDCOExternalResistor                                     \
        ROM_CS_disableDCOExternalResistor
#else
#define MAP_CS_disableDCOExternalResistor                                     \
        CS_disableDCOExternalResistor
#endif
#ifdef ROM_CS_enableInterrupt
#define MAP_CS_enableInterrupt                                                \
        ROM_CS_enableInterrupt
#else
#define MAP_CS_enableInterrupt                                                \
        CS_enableInterrupt
#endif
#ifdef ROM_CS_disableInterrupt
#define MAP_CS_disableInterrupt                                               \
        ROM_CS_disableInterrupt
#else
#define MAP_CS_disableInterrupt                                               \
        CS_disableInterrupt
#endif
#ifdef ROM_CS_getEnabledInterruptStatus
#define MAP_CS_getEnabledInterruptStatus                                      \
        ROM_CS_getEnabledInterruptStatus
#else
#define MAP_CS_getEnabledInterruptStatus                                      \
        CS_getEnabledInterruptStatus
#endif
#ifdef ROM_CS_getInterruptStatus
#define MAP_CS_getInterruptStatus                                             \
        ROM_CS_getInterruptStatus
#else
#define MAP_CS_getInterruptStatus                                             \
        CS_getInterruptStatus
#endif
#ifdef ROM_CS_setDCOFrequency
#define MAP_CS_setDCOFrequency                                                \
        ROM_CS_setDCOFrequency
#else
#define MAP_CS_setDCOFrequency                                                \
        CS_setDCOFrequency
#endif
#ifdef ROM_CS_getDCOFrequency
#define MAP_CS_getDCOFrequency                                                \
        ROM_CS_getDCOFrequency
#else
#define MAP_CS_getDCOFrequency                                                \
        CS_getDCOFrequency
#endif
#ifdef ROM_CS_enableFaultCounter
#define MAP_CS_enableFaultCounter                                             \
        ROM_CS_enableFaultCounter
#else
#define MAP_CS_enableFaultCounter                                             \
        CS_enableFaultCounter
#endif
#ifdef ROM_CS_disableFaultCounter
#define MAP_CS_disableFaultCounter                                            \
        ROM_CS_disableFaultCounter
#else
#define MAP_CS_disableFaultCounter                                            \
        CS_disableFaultCounter
#endif
#ifdef ROM_CS_resetFaultCounter
#define MAP_CS_resetFaultCounter                                              \
        ROM_CS_resetFaultCounter
#else
#define MAP_CS_resetFaultCounter                                              \
        CS_resetFaultCounter
#endif
#ifdef ROM_CS_startFaultCounter
#define MAP_CS_startFaultCounter                                              \
        ROM_CS_startFaultCounter
#else
#define MAP_CS_startFaultCounter                                              \
        CS_startFaultCounter
#endif
#ifdef ROM_CS_registerInterrupt
#define MAP_CS_registerInterrupt                                              \
        ROM_CS_registerInterrupt
#else
#define MAP_CS_registerInterrupt                                              \
        CS_registerInterrupt
#endif
#ifdef ROM_CS_unregisterInterrupt
#define MAP_CS_unregisterInterrupt                                            \
        ROM_CS_unregisterInterrupt
#else
#define MAP_CS_unregisterInterrupt                                            \
        CS_unregisterInterrupt
#endif
#ifdef ROM_CS_clearInterruptFlag
#define MAP_CS_clearInterruptFlag                                             \
        ROM_CS_clearInterruptFlag
#else
#define MAP_CS_clearInterruptFlag                                             \
        CS_clearInterruptFlag
#endif
#ifdef ROM_CS_getACLK
#define MAP_CS_getACLK                                                        \
        ROM_CS_getACLK
#else
#define MAP_CS_getACLK                                                        \
        CS_getACLK
#endif
#ifdef ROM_CS_getSMCLK
#define MAP_CS_getSMCLK                                                       \
        ROM_CS_getSMCLK
#else
#define MAP_CS_getSMCLK                                                       \
        CS_getSMCLK
#endif
#ifdef ROM_CS_getMCLK
#define MAP_CS_getMCLK                                                        \
        ROM_CS_getMCLK
#else
#define MAP_CS_getMCLK                                                        \
        CS_getMCLK
#endif
#ifdef ROM_CS_getBCLK
#define MAP_CS_getBCLK                                                        \
        ROM_CS_getBCLK
#else
#define MAP_CS_getBCLK                                                        \
        CS_getBCLK
#endif
#ifdef ROM_CS_getHSMCLK
#define MAP_CS_getHSMCLK                                                      \
        ROM_CS_getHSMCLK
#else
#define MAP_CS_getHSMCLK                                                      \
        CS_getHSMCLK
#endif
#ifdef ROM_CS_startHFXT
#define MAP_CS_startHFXT                                                      \
        ROM_CS_startHFXT
#else
#define MAP_CS_startHFXT                                                      \
        CS_startHFXT
#endif
#ifdef ROM_CS_startHFXTWithTimeout
#define MAP_CS_startHFXTWithTimeout                                           \
        ROM_CS_startHFXTWithTimeout
#else
#define MAP_CS_startHFXTWithTimeout                                           \
        CS_startHFXTWithTimeout
#endif
#ifdef ROM_CS_startLFXT
#define MAP_CS_startLFXT                                                      \
        ROM_CS_startLFXT
#else
#define MAP_CS_startLFXT                                                      \
        CS_startLFXT
#endif
#ifdef ROM_CS_startLFXTWithTimeout
#define MAP_CS_startLFXTWithTimeout                                           \
        ROM_CS_startLFXTWithTimeout
#else
#define MAP_CS_startLFXTWithTimeout                                           \
        CS_startLFXTWithTimeout
#endif
#ifdef ROM_CS_setExternalClockSourceFrequency
#define MAP_CS_setExternalClockSourceFrequency                                \
        ROM_CS_setExternalClockSourceFrequency
#else
#define MAP_CS_setExternalClockSourceFrequency                                \
        CS_setExternalClockSourceFrequency
#endif
#ifdef ROM_CS_setDCOExternalResistorCalibration
#define MAP_CS_setDCOExternalResistorCalibration                              \
        ROM_CS_setDCOExternalResistorCalibration
#else
#define MAP_CS_setDCOExternalResistorCalibration                              \
        CS_setDCOExternalResistorCalibration
#endif

//*****************************************************************************
//
// Macros for the DMA API.
//
//*****************************************************************************
#ifdef ROM_DMA_enableModule
#define MAP_DMA_enableModule                                                  \
        ROM_DMA_enableModule
#else
#define MAP_DMA_enableModule                                                  \
        DMA_enableModule
#endif
#ifdef ROM_DMA_disableModule
#define MAP_DMA_disableModule                                                 \
        ROM_DMA_disableModule
#else
#define MAP_DMA_disableModule                                                 \
        DMA_disableModule
#endif
#ifdef ROM_DMA_getErrorStatus
#define MAP_DMA_getErrorStatus                                                \
        ROM_DMA_getErrorStatus
#else
#define MAP_DMA_getErrorStatus                                                \
        DMA_getErrorStatus
#endif
#ifdef ROM_DMA_clearErrorStatus
#define MAP_DMA_clearErrorStatus                                              \
        ROM_DMA_clearErrorStatus
#else
#define MAP_DMA_clearErrorStatus                                              \
        DMA_clearErrorStatus
#endif
#ifdef ROM_DMA_enableChannel
#define MAP_DMA_enableChannel                                                 \
        ROM_DMA_enableChannel
#else
#define MAP_DMA_enableChannel                                                 \
        DMA_enableChannel
#endif
#ifdef ROM_DMA_disableChannel
#define MAP_DMA_disableChannel                                                \
        ROM_DMA_disableChannel
#else
#define MAP_DMA_disableChannel                                                \
        DMA_disableChannel
#endif
#ifdef ROM_DMA_isChannelEnabled
#define MAP_DMA_isChannelEnabled                                              \
        ROM_DMA_isChannelEnabled
#else
#define MAP_DMA_isChannelEnabled                                              \
        DMA_isChannelEnabled
#endif
#ifdef ROM_DMA_setControlBase
#define MAP_DMA_setControlBase                                                \
        ROM_DMA_setControlBase
#else
#define MAP_DMA_setControlBase                                                \
        DMA_setControlBase
#endif
#ifdef ROM_DMA_getControlBase
#define MAP_DMA_getControlBase                                                \
        ROM_DMA_getControlBase
#else
#define MAP_DMA_getControlBase                                                \
        DMA_getControlBase
#endif
#ifdef ROM_DMA_getControlAlternateBase
#define MAP_DMA_getControlAlternateBase                                       \
        ROM_DMA_getControlAlternateBase
#else
#define MAP_DMA_getControlAlternateBase                                       \
        DMA_getControlAlternateBase
#endif
#ifdef ROM_DMA_requestChannel
#define MAP_DMA_requestChannel                                                \
        ROM_DMA_requestChannel
#else
#define MAP_DMA_requestChannel                                                \
        DMA_requestChannel
#endif
#ifdef ROM_DMA_enableChannelAttribute
#define MAP_DMA_enableChannelAttribute                                        \
        ROM_DMA_enableChannelAttribute
#else
#define MAP_DMA_enableChannelAttribute                                        \
        DMA_enableChannelAttribute
#endif
#ifdef ROM_DMA_disableChannelAttribute
#define MAP_DMA_disableChannelAttribute                                       \
        ROM_DMA_disableChannelAttribute
#else
#define MAP_DMA_disableChannelAttribute                                       \
        DMA_disableChannelAttribute
#endif
#ifdef ROM_DMA_getChannelAttribute
#define MAP_DMA_getChannelAttribute                                           \
        ROM_DMA_getChannelAttribute
#else
#define MAP_DMA_getChannelAttribute                                           \
        DMA_getChannelAttribute
#endif
#ifdef ROM_DMA_setChannelControl
#define MAP_DMA_setChannelControl                                             \
        ROM_DMA_setChannelControl
#else
#define MAP_DMA_setChannelControl                                             \
        DMA_setChannelControl
#endif
#ifdef ROM_DMA_setChannelTransfer
#define MAP_DMA_setChannelTransfer                                            \
        ROM_DMA_setChannelTransfer
#else
#define MAP_DMA_setChannelTransfer                                            \
        DMA_setChannelTransfer
#endif
#ifdef ROM_DMA_setChannelScatterGather
#define MAP_DMA_setChannelScatterGather                                       \
        ROM_DMA_setChannelScatterGather
#else
#define MAP_DMA_setChannelScatterGather                                       \
        DMA_setChannelScatterGather
#endif
#ifdef ROM_DMA_getChannelSize
#define MAP_DMA_getChannelSize                                                \
        ROM_DMA_getChannelSize
#else
#define MAP_DMA_getChannelSize                                                \
        DMA_getChannelSize
#endif
#ifdef ROM_DMA_getChannelMode
#define MAP_DMA_getChannelMode                                                \
        ROM_DMA_getChannelMode
#else
#define MAP_DMA_getChannelMode                                                \
        DMA_getChannelMode
#endif
#ifdef ROM_DMA_assignChannel
#define MAP_DMA_assignChannel                                                 \
        ROM_DMA_assignChannel
#else
#define MAP_DMA_assignChannel                                                 \
        DMA_assignChannel
#endif
#ifdef ROM_DMA_requestSoftwareTransfer
#define MAP_DMA_requestSoftwareTransfer                                       \
        ROM_DMA_requestSoftwareTransfer
#else
#define MAP_DMA_requestSoftwareTransfer                                       \
        DMA_requestSoftwareTransfer
#endif
#ifdef ROM_DMA_assignInterrupt
#define MAP_DMA_assignInterrupt                                               \
        ROM_DMA_assignInterrupt
#else
#define MAP_DMA_assignInterrupt                                               \
        DMA_assignInterrupt
#endif
#ifdef ROM_DMA_enableInterrupt
#define MAP_DMA_enableInterrupt                                               \
        ROM_DMA_enableInterrupt
#else
#define MAP_DMA_enableInterrupt                                               \
        DMA_enableInterrupt
#endif
#ifdef ROM_DMA_disableInterrupt
#define MAP_DMA_disableInterrupt                                              \
        ROM_DMA_disableInterrupt
#else
#define MAP_DMA_disableInterrupt                                              \
        DMA_disableInterrupt
#endif
#ifdef ROM_DMA_getInterruptStatus
#define MAP_DMA_getInterruptStatus                                            \
        ROM_DMA_getInterruptStatus
#else
#define MAP_DMA_getInterruptStatus                                            \
        DMA_getInterruptStatus
#endif
#ifdef ROM_DMA_clearInterruptFlag
#define MAP_DMA_clearInterruptFlag                                            \
        ROM_DMA_clearInterruptFlag
#else
#define MAP_DMA_clearInterruptFlag                                            \
        DMA_clearInterruptFlag
#endif
#ifdef ROM_DMA_registerInterrupt
#define MAP_DMA_registerInterrupt                                             \
        ROM_DMA_registerInterrupt
#else
#define MAP_DMA_registerInterrupt                                             \
        DMA_registerInterrupt
#endif
#ifdef ROM_DMA_unregisterInterrupt
#define MAP_DMA_unregisterInterrupt                                           \
        ROM_DMA_unregisterInterrupt
#else
#define MAP_DMA_unregisterInterrupt                                           \
        DMA_unregisterInterrupt
#endif

