arduino/Arduino/hardware/msp432/cores/msp432/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the PCM API.
//
//*****************************************************************************
#ifdef ROM_PCM_setCoreVoltageLevel
#define MAP_PCM_setCoreVoltageLevel                                           \
        ROM_PCM_setCoreVoltageLevel
#else
#define MAP_PCM_setCoreVoltageLevel                                           \
        PCM_setCoreVoltageLevel
#endif
#ifdef ROM_PCM_getCoreVoltageLevel
#define MAP_PCM_getCoreVoltageLevel                                           \
        ROM_PCM_getCoreVoltageLevel
#else
#define MAP_PCM_getCoreVoltageLevel                                           \
        PCM_getCoreVoltageLevel
#endif
#ifdef ROM_PCM_setCoreVoltageLevelWithTimeout
#define MAP_PCM_setCoreVoltageLevelWithTimeout                                \
        ROM_PCM_setCoreVoltageLevelWithTimeout
#else
#define MAP_PCM_setCoreVoltageLevelWithTimeout                                \
        PCM_setCoreVoltageLevelWithTimeout
#endif
#ifdef ROM_PCM_setPowerMode
#define MAP_PCM_setPowerMode                                                  \
        ROM_PCM_setPowerMode
#else
#define MAP_PCM_setPowerMode                                                  \
        PCM_setPowerMode
#endif
#ifdef ROM_PCM_setPowerModeWithTimeout
#define MAP_PCM_setPowerModeWithTimeout                                       \
        ROM_PCM_setPowerModeWithTimeout
#else
#define MAP_PCM_setPowerModeWithTimeout                                       \
        PCM_setPowerModeWithTimeout
#endif
#ifdef ROM_PCM_getPowerMode
#define MAP_PCM_getPowerMode                                                  \
        ROM_PCM_getPowerMode
#else
#define MAP_PCM_getPowerMode                                                  \
        PCM_getPowerMode
#endif
#ifdef ROM_PCM_setPowerState
#define MAP_PCM_setPowerState                                                 \
        ROM_PCM_setPowerState
#else
#define MAP_PCM_setPowerState                                                 \
        PCM_setPowerState
#endif
#ifdef ROM_PCM_setPowerStateWithTimeout
#define MAP_PCM_setPowerStateWithTimeout                                      \
        ROM_PCM_setPowerStateWithTimeout
#else
#define MAP_PCM_setPowerStateWithTimeout                                      \
        PCM_setPowerStateWithTimeout
#endif
#ifdef ROM_PCM_getPowerState
#define MAP_PCM_getPowerState                                                 \
        ROM_PCM_getPowerState
#else
#define MAP_PCM_getPowerState                                                 \
        PCM_getPowerState
#endif
#ifdef ROM_PCM_shutdownDevice
#define MAP_PCM_shutdownDevice                                                \
        ROM_PCM_shutdownDevice
#else
#define MAP_PCM_shutdownDevice                                                \
        PCM_shutdownDevice
#endif
#ifdef ROM_PCM_gotoLPM0
#define MAP_PCM_gotoLPM0                                                      \
        ROM_PCM_gotoLPM0
#else
#define MAP_PCM_gotoLPM0                                                      \
        PCM_gotoLPM0
#endif
#ifdef ROM_PCM_gotoLPM3
#define MAP_PCM_gotoLPM3                                                      \
        ROM_PCM_gotoLPM3
#else
#define MAP_PCM_gotoLPM3                                                      \
        PCM_gotoLPM3
#endif
#ifdef ROM_PCM_enableInterrupt
#define MAP_PCM_enableInterrupt                                               \
        ROM_PCM_enableInterrupt
#else
#define MAP_PCM_enableInterrupt                                               \
        PCM_enableInterrupt
#endif
#ifdef ROM_PCM_disableInterrupt
#define MAP_PCM_disableInterrupt                                              \
        ROM_PCM_disableInterrupt
#else
#define MAP_PCM_disableInterrupt                                              \
        PCM_disableInterrupt
#endif
#ifdef ROM_PCM_getInterruptStatus
#define MAP_PCM_getInterruptStatus                                            \
        ROM_PCM_getInterruptStatus
#else
#define MAP_PCM_getInterruptStatus                                            \
        PCM_getInterruptStatus
#endif
#ifdef ROM_PCM_getEnabledInterruptStatus
#define MAP_PCM_getEnabledInterruptStatus                                     \
        ROM_PCM_getEnabledInterruptStatus
#else
#define MAP_PCM_getEnabledInterruptStatus                                     \
        PCM_getEnabledInterruptStatus
#endif
#ifdef ROM_PCM_clearInterruptFlag
#define MAP_PCM_clearInterruptFlag                                            \
        ROM_PCM_clearInterruptFlag
#else
#define MAP_PCM_clearInterruptFlag                                            \
        PCM_clearInterruptFlag
#endif
#ifdef ROM_PCM_enableRudeMode
#define MAP_PCM_enableRudeMode                                                \
        ROM_PCM_enableRudeMode
#else
#define MAP_PCM_enableRudeMode                                                \
        PCM_enableRudeMode
#endif
#ifdef ROM_PCM_disableRudeMode
#define MAP_PCM_disableRudeMode                                               \
        ROM_PCM_disableRudeMode
#else
#define MAP_PCM_disableRudeMode                                               \
        PCM_disableRudeMode
#endif
#ifdef ROM_PCM_gotoLPM0InterruptSafe
#define MAP_PCM_gotoLPM0InterruptSafe                                         \
        ROM_PCM_gotoLPM0InterruptSafe
#else
#define MAP_PCM_gotoLPM0InterruptSafe                                         \
        PCM_gotoLPM0InterruptSafe
#endif
#ifdef ROM_PCM_gotoLPM3InterruptSafe
#define MAP_PCM_gotoLPM3InterruptSafe                                         \
        ROM_PCM_gotoLPM3InterruptSafe
#else
#define MAP_PCM_gotoLPM3InterruptSafe                                         \
        PCM_gotoLPM3InterruptSafe
#endif
#ifdef ROM_PCM_registerInterrupt
#define MAP_PCM_registerInterrupt                                             \
        ROM_PCM_registerInterrupt
#else
#define MAP_PCM_registerInterrupt                                             \
        PCM_registerInterrupt
#endif
#ifdef ROM_PCM_unregisterInterrupt
#define MAP_PCM_unregisterInterrupt                                           \
        ROM_PCM_unregisterInterrupt
#else
#define MAP_PCM_unregisterInterrupt                                           \
        PCM_unregisterInterrupt
#endif
#ifdef ROM_PCM_setCoreVoltageLevelNonBlocking
#define MAP_PCM_setCoreVoltageLevelNonBlocking                                \
        ROM_PCM_setCoreVoltageLevelNonBlocking
#else
#define MAP_PCM_setCoreVoltageLevelNonBlocking                                \
        PCM_setCoreVoltageLevelNonBlocking
#endif
#ifdef ROM_PCM_setPowerModeNonBlocking
#define MAP_PCM_setPowerModeNonBlocking                                       \
        ROM_PCM_setPowerModeNonBlocking
#else
#define MAP_PCM_setPowerModeNonBlocking                                       \
        PCM_setPowerModeNonBlocking
#endif
#ifdef ROM_PCM_setPowerStateNonBlocking
#define MAP_PCM_setPowerStateNonBlocking                                      \
        ROM_PCM_setPowerStateNonBlocking
#else
#define MAP_PCM_setPowerStateNonBlocking                                      \
        PCM_setPowerStateNonBlocking
#endif
#ifdef ROM_PCM_gotoLPM4
#define MAP_PCM_gotoLPM4                                                      \
        ROM_PCM_gotoLPM4
#else
#define MAP_PCM_gotoLPM4                                                      \
        PCM_gotoLPM4
#endif
#ifdef ROM_PCM_gotoLPM4InterruptSafe
#define MAP_PCM_gotoLPM4InterruptSafe                                         \
        ROM_PCM_gotoLPM4InterruptSafe
#else
#define MAP_PCM_gotoLPM4InterruptSafe                                         \
        PCM_gotoLPM4InterruptSafe
#endif

//*****************************************************************************
//
// Macros for the PMAP API.
//
//*****************************************************************************
#ifdef ROM_PMAP_configurePorts
#define MAP_PMAP_configurePorts                                               \
        ROM_PMAP_configurePorts
#else
#define MAP_PMAP_configurePorts                                               \
        PMAP_configurePorts
#endif

//*****************************************************************************
//
// Macros for the PSS API.
//
//*****************************************************************************
#ifdef ROM_PSS_enableHighSidePinToggle
#define MAP_PSS_enableHighSidePinToggle                                       \
        ROM_PSS_enableHighSidePinToggle
#else
#define MAP_PSS_enableHighSidePinToggle                                       \
        PSS_enableHighSidePinToggle
#endif
#ifdef ROM_PSS_disableHighSidePinToggle
#define MAP_PSS_disableHighSidePinToggle                                      \
        ROM_PSS_disableHighSidePinToggle
#else
#define MAP_PSS_disableHighSidePinToggle                                      \
        PSS_disableHighSidePinToggle
#endif
#ifdef ROM_PSS_enableHighSide
#define MAP_PSS_enableHighSide                                                \
        ROM_PSS_enableHighSide
#else
#define MAP_PSS_enableHighSide                                                \
        PSS_enableHighSide
#endif
#ifdef ROM_PSS_disableHighSide
#define MAP_PSS_disableHighSide                                               \
        ROM_PSS_disableHighSide
#else
#define MAP_PSS_disableHighSide                                               \
        PSS_disableHighSide
#endif
#ifdef ROM_PSS_setHighSidePerformanceMode
#define MAP_PSS_setHighSidePerformanceMode                                    \
        ROM_PSS_setHighSidePerformanceMode
#else
#define MAP_PSS_setHighSidePerformanceMode                                    \
        PSS_setHighSidePerformanceMode
#endif
#ifdef ROM_PSS_getHighSidePerformanceMode
#define MAP_PSS_getHighSidePerformanceMode                                    \
        ROM_PSS_getHighSidePerformanceMode
#else
#define MAP_PSS_getHighSidePerformanceMode                                    \
        PSS_getHighSidePerformanceMode
#endif
#ifdef ROM_PSS_enableHighSideMonitor
#define MAP_PSS_enableHighSideMonitor                                         \
        ROM_PSS_enableHighSideMonitor
#else
#define MAP_PSS_enableHighSideMonitor                                         \
        PSS_enableHighSideMonitor
#endif
#ifdef ROM_PSS_disableHighSideMonitor
#define MAP_PSS_disableHighSideMonitor                                        \
        ROM_PSS_disableHighSideMonitor
#else
#define MAP_PSS_disableHighSideMonitor                                        \
        PSS_disableHighSideMonitor
#endif
#ifdef ROM_PSS_setHighSideVoltageTrigger
#define MAP_PSS_setHighSideVoltageTrigger                                     \
        ROM_PSS_setHighSideVoltageTrigger
#else
#define MAP_PSS_setHighSideVoltageTrigger                                     \
        PSS_setHighSideVoltageTrigger
#endif
#ifdef ROM_PSS_getHighSideVoltageTrigger
#define MAP_PSS_getHighSideVoltageTrigger                                     \
        ROM_PSS_getHighSideVoltageTrigger
#else
#define MAP_PSS_getHighSideVoltageTrigger                                     \
        PSS_getHighSideVoltageTrigger
#endif
#ifdef ROM_PSS_enableInterrupt
#define MAP_PSS_enableInterrupt                                               \
        ROM_PSS_enableInterrupt
#else
#define MAP_PSS_enableInterrupt                                               \
        PSS_enableInterrupt
#endif
#ifdef ROM_PSS_disableInterrupt
#define MAP_PSS_disableInterrupt                                              \
        ROM_PSS_disableInterrupt
#else
#define MAP_PSS_disableInterrupt                                              \
        PSS_disableInterrupt
#endif
#ifdef ROM_PSS_getInterruptStatus
#define MAP_PSS_getInterruptStatus                                            \
        ROM_PSS_getInterruptStatus
#else
#define MAP_PSS_getInterruptStatus                                            \
        PSS_getInterruptStatus
#endif
#ifdef ROM_PSS_clearInterruptFlag
#define MAP_PSS_clearInterruptFlag                                            \
        ROM_PSS_clearInterruptFlag
#else
#define MAP_PSS_clearInterruptFlag                                            \
        PSS_clearInterruptFlag
#endif
#ifdef ROM_PSS_registerInterrupt
#define MAP_PSS_registerInterrupt                                             \
        ROM_PSS_registerInterrupt
#else
#define MAP_PSS_registerInterrupt                                             \
        PSS_registerInterrupt
#endif
#ifdef ROM_PSS_unregisterInterrupt
#define MAP_PSS_unregisterInterrupt                                           \
        ROM_PSS_unregisterInterrupt
#else
#define MAP_PSS_unregisterInterrupt                                           \
        PSS_unregisterInterrupt
#endif
#ifdef ROM_PSS_enableForcedDCDCOperation
#define MAP_PSS_enableForcedDCDCOperation                                     \
        ROM_PSS_enableForcedDCDCOperation
#else
#define MAP_PSS_enableForcedDCDCOperation                                     \
        PSS_enableForcedDCDCOperation
#endif
#ifdef ROM_PSS_disableForcedDCDCOperation
#define MAP_PSS_disableForcedDCDCOperation                                    \
        ROM_PSS_disableForcedDCDCOperation
#else
#define MAP_PSS_disableForcedDCDCOperation                                    \
        PSS_disableForcedDCDCOperation
#endif

//*****************************************************************************
//
// Macros for the Ref API.
//
//*****************************************************************************
#ifdef ROM_REF_A_setReferenceVoltage
#define MAP_REF_A_setReferenceVoltage                                         \
        ROM_REF_A_setReferenceVoltage
#else
#define MAP_REF_A_setReferenceVoltage                                         \
        REF_A_setReferenceVoltage
#endif
#ifdef ROM_REF_A_disableTempSensor
#define MAP_REF_A_disableTempSensor                                           \
        ROM_REF_A_disableTempSensor
#else
#define MAP_REF_A_disableTempSensor                                           \
        REF_A_disableTempSensor
#endif
#ifdef ROM_REF_A_enableTempSensor
#define MAP_REF_A_enableTempSensor                                            \
        ROM_REF_A_enableTempSensor
#else
#define MAP_REF_A_enableTempSensor                                            \
        REF_A_enableTempSensor
#endif
#ifdef ROM_REF_A_enableReferenceVoltageOutput
#define MAP_REF_A_enableReferenceVoltageOutput                                \
        ROM_REF_A_enableReferenceVoltageOutput
#else
#define MAP_REF_A_enableReferenceVoltageOutput                                \
        REF_A_enableReferenceVoltageOutput
#endif
#ifdef ROM_REF_A_disableReferenceVoltageOutput
#define MAP_REF_A_disableReferenceVoltageOutput                               \
        ROM_REF_A_disableReferenceVoltageOutput
#else
#define MAP_REF_A_disableReferenceVoltageOutput                               \
        REF_A_disableReferenceVoltageOutput
#endif
#ifdef ROM_REF_A_enableReferenceVoltage
#define MAP_REF_A_enableReferenceVoltage                                      \
        ROM_REF_A_enableReferenceVoltage
#else
#define MAP_REF_A_enableReferenceVoltage                                      \
        REF_A_enableReferenceVoltage
#endif
#ifdef ROM_REF_A_disableReferenceVoltage
#define MAP_REF_A_disableReferenceVoltage                                     \
        ROM_REF_A_disableReferenceVoltage
#else
#define MAP_REF_A_disableReferenceVoltage                                     \
        REF_A_disableReferenceVoltage
#endif
#ifdef ROM_REF_A_getBandgapMode
#define MAP_REF_A_getBandgapMode                                              \
        ROM_REF_A_getBandgapMode
#else
#define MAP_REF_A_getBandgapMode                                              \
        REF_A_getBandgapMode
#endif
#ifdef ROM_REF_A_isBandgapActive
#define MAP_REF_A_isBandgapActive                                             \
        ROM_REF_A_isBandgapActive
#else
#define MAP_REF_A_isBandgapActive                                             \
        REF_A_isBandgapActive
#endif
#ifdef ROM_REF_A_isRefGenBusy
#define MAP_REF_A_isRefGenBusy                                                \
        ROM_REF_A_isRefGenBusy
#else
#define MAP_REF_A_isRefGenBusy                                                \
        REF_A_isRefGenBusy
#endif
#ifdef ROM_REF_A_isRefGenActive
#define MAP_REF_A_isRefGenActive                                              \
        ROM_REF_A_isRefGenActive
#else
#define MAP_REF_A_isRefGenActive                                              \
        REF_A_isRefGenActive
#endif
#ifdef ROM_REF_A_getBufferedBandgapVoltageStatus
#define MAP_REF_A_getBufferedBandgapVoltageStatus                             \
        ROM_REF_A_getBufferedBandgapVoltageStatus
#else
#define MAP_REF_A_getBufferedBandgapVoltageStatus                             \
        REF_A_getBufferedBandgapVoltageStatus
#endif
#ifdef ROM_REF_A_getVariableReferenceVoltageStatus
#define MAP_REF_A_getVariableReferenceVoltageStatus                           \
        ROM_REF_A_getVariableReferenceVoltageStatus
#else
#define MAP_REF_A_getVariableReferenceVoltageStatus                           \
        REF_A_getVariableReferenceVoltageStatus
#endif
#ifdef ROM_REF_A_setReferenceVoltageOneTimeTrigger
#define MAP_REF_A_setReferenceVoltageOneTimeTrigger                           \
        ROM_REF_A_setReferenceVoltageOneTimeTrigger
#else
#define MAP_REF_A_setReferenceVoltageOneTimeTrigger                           \
        REF_A_setReferenceVoltageOneTimeTrigger
#endif
#ifdef ROM_REF_A_setBufferedBandgapVoltageOneTimeTrigger
#define MAP_REF_A_setBufferedBandgapVoltageOneTimeTrigger                     \
        ROM_REF_A_setBufferedBandgapVoltageOneTimeTrigger
#else
#define MAP_REF_A_setBufferedBandgapVoltageOneTimeTrigger                     \
        REF_A_setBufferedBandgapVoltageOneTimeTrigger
#endif

//*****************************************************************************
//
// Macros for the ResetCtl API.
//
//*****************************************************************************
#ifdef ROM_ResetCtl_initiateSoftReset
#define MAP_ResetCtl_initiateSoftReset                                        \
        ROM_ResetCtl_initiateSoftReset
#else
#define MAP_ResetCtl_initiateSoftReset                                        \
        ResetCtl_initiateSoftReset
#endif
#ifdef ROM_ResetCtl_initiateSoftResetWithSource
#define MAP_ResetCtl_initiateSoftResetWithSource                              \
        ROM_ResetCtl_initiateSoftResetWithSource
#else
#define MAP_ResetCtl_initiateSoftResetWithSource                              \
        ResetCtl_initiateSoftResetWithSource
#endif
#ifdef ROM_ResetCtl_getSoftResetSource
#define MAP_ResetCtl_getSoftResetSource                                       \
        ROM_ResetCtl_getSoftResetSource
#else
#define MAP_ResetCtl_getSoftResetSource                                       \
        ResetCtl_getSoftResetSource
#endif
#ifdef ROM_ResetCtl_clearSoftResetSource
#define MAP_ResetCtl_clearSoftResetSource                                     \
        ROM_ResetCtl_clearSoftResetSource
#else
#define MAP_ResetCtl_clearSoftResetSource                                     \
        ResetCtl_clearSoftResetSource
#endif
#ifdef ROM_ResetCtl_initiateHardReset
#define MAP_ResetCtl_initiateHardReset                                        \
        ROM_ResetCtl_initiateHardReset
#else
#define MAP_ResetCtl_initiateHardReset                                        \
        ResetCtl_initiateHardReset
#endif
#ifdef ROM_ResetCtl_initiateHardResetWithSource
#define MAP_ResetCtl_initiateHardResetWithSource                              \
        ROM_ResetCtl_initiateHardResetWithSource
#else
#define MAP_ResetCtl_initiateHardResetWithSource                              \
        ResetCtl_initiateHardResetWithSource
#endif
#ifdef ROM_ResetCtl_getHardResetSource
#define MAP_ResetCtl_getHardResetSource                                       \
        ROM_ResetCtl_getHardResetSource
#else
#define MAP_ResetCtl_getHardResetSource                                       \
        ResetCtl_getHardResetSource
#endif
#ifdef ROM_ResetCtl_clearHardResetSource
#define MAP_ResetCtl_clearHardResetSource                                     \
        ROM_ResetCtl_clearHardResetSource
#else
#define MAP_ResetCtl_clearHardResetSource                                     \
        ResetCtl_clearHardResetSource
#endif
#ifdef ROM_ResetCtl_getPSSSource
#define MAP_ResetCtl_getPSSSource                                             \
        ROM_ResetCtl_getPSSSource
#else
#define MAP_ResetCtl_getPSSSource                                             \
        ResetCtl_getPSSSource
#endif
#ifdef ROM_ResetCtl_clearPSSFlags
#define MAP_ResetCtl_clearPSSFlags                                            \
        ROM_ResetCtl_clearPSSFlags
#else
#define MAP_ResetCtl_clearPSSFlags                                            \
        ResetCtl_clearPSSFlags
#endif
#ifdef ROM_ResetCtl_getPCMSource
#define MAP_ResetCtl_getPCMSource                                             \
        ROM_ResetCtl_getPCMSource
#else
#define MAP_ResetCtl_getPCMSource                                             \
        ResetCtl_getPCMSource
#endif
#ifdef ROM_ResetCtl_clearPCMFlags
#define MAP_ResetCtl_clearPCMFlags                                            \
        ROM_ResetCtl_clearPCMFlags
#else
#define MAP_ResetCtl_clearPCMFlags                                            \
        ResetCtl_clearPCMFlags
#endif

