arduino/Arduino/hardware/msp432/cores/msp432/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the RTC API.
//
//*****************************************************************************
#ifdef ROM_RTC_C_startClock
#define MAP_RTC_C_startClock                                                  \
        ROM_RTC_C_startClock
#else
#define MAP_RTC_C_startClock                                                  \
        RTC_C_startClock
#endif
#ifdef ROM_RTC_C_holdClock
#define MAP_RTC_C_holdClock                                                   \
        ROM_RTC_C_holdClock
#else
#define MAP_RTC_C_holdClock                                                   \
        RTC_C_holdClock
#endif
#ifdef ROM_RTC_C_setCalibrationFrequency
#define MAP_RTC_C_setCalibrationFrequency                                     \
        ROM_RTC_C_setCalibrationFrequency
#else
#define MAP_RTC_C_setCalibrationFrequency                                     \
        RTC_C_setCalibrationFrequency
#endif
#ifdef ROM_RTC_C_setCalibrationData
#define MAP_RTC_C_setCalibrationData                                          \
        ROM_RTC_C_setCalibrationData
#else
#define MAP_RTC_C_setCalibrationData                                          \
        RTC_C_setCalibrationData
#endif
#ifdef ROM_RTC_C_setTemperatureCompensation
#define MAP_RTC_C_setTemperatureCompensation                                  \
        ROM_RTC_C_setTemperatureCompensation
#else
#define MAP_RTC_C_setTemperatureCompensation                                  \
        RTC_C_setTemperatureCompensation
#endif
#ifdef ROM_RTC_C_initCalendar
#define MAP_RTC_C_initCalendar                                                \
        ROM_RTC_C_initCalendar
#else
#define MAP_RTC_C_initCalendar                                                \
        RTC_C_initCalendar
#endif
#ifdef ROM_RTC_C_getCalendarTime
#define MAP_RTC_C_getCalendarTime                                             \
        ROM_RTC_C_getCalendarTime
#else
#define MAP_RTC_C_getCalendarTime                                             \
        RTC_C_getCalendarTime
#endif
#ifdef ROM_RTC_C_setCalendarAlarm
#define MAP_RTC_C_setCalendarAlarm                                            \
        ROM_RTC_C_setCalendarAlarm
#else
#define MAP_RTC_C_setCalendarAlarm                                            \
        RTC_C_setCalendarAlarm
#endif
#ifdef ROM_RTC_C_setCalendarEvent
#define MAP_RTC_C_setCalendarEvent                                            \
        ROM_RTC_C_setCalendarEvent
#else
#define MAP_RTC_C_setCalendarEvent                                            \
        RTC_C_setCalendarEvent
#endif
#ifdef ROM_RTC_C_definePrescaleEvent
#define MAP_RTC_C_definePrescaleEvent                                         \
        ROM_RTC_C_definePrescaleEvent
#else
#define MAP_RTC_C_definePrescaleEvent                                         \
        RTC_C_definePrescaleEvent
#endif
#ifdef ROM_RTC_C_getPrescaleValue
#define MAP_RTC_C_getPrescaleValue                                            \
        ROM_RTC_C_getPrescaleValue
#else
#define MAP_RTC_C_getPrescaleValue                                            \
        RTC_C_getPrescaleValue
#endif
#ifdef ROM_RTC_C_setPrescaleValue
#define MAP_RTC_C_setPrescaleValue                                            \
        ROM_RTC_C_setPrescaleValue
#else
#define MAP_RTC_C_setPrescaleValue                                            \
        RTC_C_setPrescaleValue
#endif
#ifdef ROM_RTC_C_convertBCDToBinary
#define MAP_RTC_C_convertBCDToBinary                                          \
        ROM_RTC_C_convertBCDToBinary
#else
#define MAP_RTC_C_convertBCDToBinary                                          \
        RTC_C_convertBCDToBinary
#endif
#ifdef ROM_RTC_C_convertBinaryToBCD
#define MAP_RTC_C_convertBinaryToBCD                                          \
        ROM_RTC_C_convertBinaryToBCD
#else
#define MAP_RTC_C_convertBinaryToBCD                                          \
        RTC_C_convertBinaryToBCD
#endif
#ifdef ROM_RTC_C_enableInterrupt
#define MAP_RTC_C_enableInterrupt                                             \
        ROM_RTC_C_enableInterrupt
#else
#define MAP_RTC_C_enableInterrupt                                             \
        RTC_C_enableInterrupt
#endif
#ifdef ROM_RTC_C_disableInterrupt
#define MAP_RTC_C_disableInterrupt                                            \
        ROM_RTC_C_disableInterrupt
#else
#define MAP_RTC_C_disableInterrupt                                            \
        RTC_C_disableInterrupt
#endif
#ifdef ROM_RTC_C_getInterruptStatus
#define MAP_RTC_C_getInterruptStatus                                          \
        ROM_RTC_C_getInterruptStatus
#else
#define MAP_RTC_C_getInterruptStatus                                          \
        RTC_C_getInterruptStatus
#endif
#ifdef ROM_RTC_C_getEnabledInterruptStatus
#define MAP_RTC_C_getEnabledInterruptStatus                                   \
        ROM_RTC_C_getEnabledInterruptStatus
#else
#define MAP_RTC_C_getEnabledInterruptStatus                                   \
        RTC_C_getEnabledInterruptStatus
#endif
#ifdef ROM_RTC_C_clearInterruptFlag
#define MAP_RTC_C_clearInterruptFlag                                          \
        ROM_RTC_C_clearInterruptFlag
#else
#define MAP_RTC_C_clearInterruptFlag                                          \
        RTC_C_clearInterruptFlag
#endif
#ifdef ROM_RTC_C_registerInterrupt
#define MAP_RTC_C_registerInterrupt                                           \
        ROM_RTC_C_registerInterrupt
#else
#define MAP_RTC_C_registerInterrupt                                           \
        RTC_C_registerInterrupt
#endif
#ifdef ROM_RTC_C_unregisterInterrupt
#define MAP_RTC_C_unregisterInterrupt                                         \
        ROM_RTC_C_unregisterInterrupt
#else
#define MAP_RTC_C_unregisterInterrupt                                         \
        RTC_C_unregisterInterrupt
#endif

//*****************************************************************************
//
// Macros for the SPI API.
//
//*****************************************************************************
#ifdef ROM_SPI_initMaster
#define MAP_SPI_initMaster                                                    \
        ROM_SPI_initMaster
#else
#define MAP_SPI_initMaster                                                    \
        SPI_initMaster
#endif
#ifdef ROM_SPI_selectFourPinFunctionality
#define MAP_SPI_selectFourPinFunctionality                                    \
        ROM_SPI_selectFourPinFunctionality
#else
#define MAP_SPI_selectFourPinFunctionality                                    \
        SPI_selectFourPinFunctionality
#endif
#ifdef ROM_SPI_changeMasterClock
#define MAP_SPI_changeMasterClock                                             \
        ROM_SPI_changeMasterClock
#else
#define MAP_SPI_changeMasterClock                                             \
        SPI_changeMasterClock
#endif
#ifdef ROM_SPI_initSlave
#define MAP_SPI_initSlave                                                     \
        ROM_SPI_initSlave
#else
#define MAP_SPI_initSlave                                                     \
        SPI_initSlave
#endif
#ifdef ROM_SPI_changeClockPhasePolarity
#define MAP_SPI_changeClockPhasePolarity                                      \
        ROM_SPI_changeClockPhasePolarity
#else
#define MAP_SPI_changeClockPhasePolarity                                      \
        SPI_changeClockPhasePolarity
#endif
#ifdef ROM_SPI_transmitData
#define MAP_SPI_transmitData                                                  \
        ROM_SPI_transmitData
#else
#define MAP_SPI_transmitData                                                  \
        SPI_transmitData
#endif
#ifdef ROM_SPI_receiveData
#define MAP_SPI_receiveData                                                   \
        ROM_SPI_receiveData
#else
#define MAP_SPI_receiveData                                                   \
        SPI_receiveData
#endif
#ifdef ROM_SPI_enableModule
#define MAP_SPI_enableModule                                                  \
        ROM_SPI_enableModule
#else
#define MAP_SPI_enableModule                                                  \
        SPI_enableModule
#endif
#ifdef ROM_SPI_disableModule
#define MAP_SPI_disableModule                                                 \
        ROM_SPI_disableModule
#else
#define MAP_SPI_disableModule                                                 \
        SPI_disableModule
#endif
#ifdef ROM_SPI_getReceiveBufferAddressForDMA
#define MAP_SPI_getReceiveBufferAddressForDMA                                 \
        ROM_SPI_getReceiveBufferAddressForDMA
#else
#define MAP_SPI_getReceiveBufferAddressForDMA                                 \
        SPI_getReceiveBufferAddressForDMA
#endif
#ifdef ROM_SPI_getTransmitBufferAddressForDMA
#define MAP_SPI_getTransmitBufferAddressForDMA                                \
        ROM_SPI_getTransmitBufferAddressForDMA
#else
#define MAP_SPI_getTransmitBufferAddressForDMA                                \
        SPI_getTransmitBufferAddressForDMA
#endif
#ifdef ROM_SPI_isBusy
#define MAP_SPI_isBusy                                                        \
        ROM_SPI_isBusy
#else
#define MAP_SPI_isBusy                                                        \
        SPI_isBusy
#endif
#ifdef ROM_SPI_enableInterrupt
#define MAP_SPI_enableInterrupt                                               \
        ROM_SPI_enableInterrupt
#else
#define MAP_SPI_enableInterrupt                                               \
        SPI_enableInterrupt
#endif
#ifdef ROM_SPI_disableInterrupt
#define MAP_SPI_disableInterrupt                                              \
        ROM_SPI_disableInterrupt
#else
#define MAP_SPI_disableInterrupt                                              \
        SPI_disableInterrupt
#endif
#ifdef ROM_SPI_getInterruptStatus
#define MAP_SPI_getInterruptStatus                                            \
        ROM_SPI_getInterruptStatus
#else
#define MAP_SPI_getInterruptStatus                                            \
        SPI_getInterruptStatus
#endif
#ifdef ROM_SPI_getEnabledInterruptStatus
#define MAP_SPI_getEnabledInterruptStatus                                     \
        ROM_SPI_getEnabledInterruptStatus
#else
#define MAP_SPI_getEnabledInterruptStatus                                     \
        SPI_getEnabledInterruptStatus
#endif
#ifdef ROM_SPI_clearInterruptFlag
#define MAP_SPI_clearInterruptFlag                                            \
        ROM_SPI_clearInterruptFlag
#else
#define MAP_SPI_clearInterruptFlag                                            \
        SPI_clearInterruptFlag
#endif
#ifdef ROM_SPI_registerInterrupt
#define MAP_SPI_registerInterrupt                                             \
        ROM_SPI_registerInterrupt
#else
#define MAP_SPI_registerInterrupt                                             \
        SPI_registerInterrupt
#endif
#ifdef ROM_SPI_unregisterInterrupt
#define MAP_SPI_unregisterInterrupt                                           \
        ROM_SPI_unregisterInterrupt
#else
#define MAP_SPI_unregisterInterrupt                                           \
        SPI_unregisterInterrupt
#endif

//*****************************************************************************
//
// Macros for the SysCtl API.
//
//*****************************************************************************
#ifdef ROM_SysCtl_getSRAMSize
#define MAP_SysCtl_getSRAMSize                                                \
        ROM_SysCtl_getSRAMSize
#else
#define MAP_SysCtl_getSRAMSize                                                \
        SysCtl_getSRAMSize
#endif
#ifdef ROM_SysCtl_getFlashSize
#define MAP_SysCtl_getFlashSize                                               \
        ROM_SysCtl_getFlashSize
#else
#define MAP_SysCtl_getFlashSize                                               \
        SysCtl_getFlashSize
#endif
#ifdef ROM_SysCtl_rebootDevice
#define MAP_SysCtl_rebootDevice                                               \
        ROM_SysCtl_rebootDevice
#else
#define MAP_SysCtl_rebootDevice                                               \
        SysCtl_rebootDevice
#endif
#ifdef ROM_SysCtl_enableSRAMBank
#define MAP_SysCtl_enableSRAMBank                                             \
        ROM_SysCtl_enableSRAMBank
#else
#define MAP_SysCtl_enableSRAMBank                                             \
        SysCtl_enableSRAMBank
#endif
#ifdef ROM_SysCtl_disableSRAMBank
#define MAP_SysCtl_disableSRAMBank                                            \
        ROM_SysCtl_disableSRAMBank
#else
#define MAP_SysCtl_disableSRAMBank                                            \
        SysCtl_disableSRAMBank
#endif
#ifdef ROM_SysCtl_enableSRAMBankRetention
#define MAP_SysCtl_enableSRAMBankRetention                                    \
        ROM_SysCtl_enableSRAMBankRetention
#else
#define MAP_SysCtl_enableSRAMBankRetention                                    \
        SysCtl_enableSRAMBankRetention
#endif
#ifdef ROM_SysCtl_disableSRAMBankRetention
#define MAP_SysCtl_disableSRAMBankRetention                                   \
        ROM_SysCtl_disableSRAMBankRetention
#else
#define MAP_SysCtl_disableSRAMBankRetention                                   \
        SysCtl_disableSRAMBankRetention
#endif
#ifdef ROM_SysCtl_enablePeripheralAtCPUHalt
#define MAP_SysCtl_enablePeripheralAtCPUHalt                                  \
        ROM_SysCtl_enablePeripheralAtCPUHalt
#else
#define MAP_SysCtl_enablePeripheralAtCPUHalt                                  \
        SysCtl_enablePeripheralAtCPUHalt
#endif
#ifdef ROM_SysCtl_disablePeripheralAtCPUHalt
#define MAP_SysCtl_disablePeripheralAtCPUHalt                                 \
        ROM_SysCtl_disablePeripheralAtCPUHalt
#else
#define MAP_SysCtl_disablePeripheralAtCPUHalt                                 \
        SysCtl_disablePeripheralAtCPUHalt
#endif
#ifdef ROM_SysCtl_setWDTTimeoutResetType
#define MAP_SysCtl_setWDTTimeoutResetType                                     \
        ROM_SysCtl_setWDTTimeoutResetType
#else
#define MAP_SysCtl_setWDTTimeoutResetType                                     \
        SysCtl_setWDTTimeoutResetType
#endif
#ifdef ROM_SysCtl_setWDTPasswordViolationResetType
#define MAP_SysCtl_setWDTPasswordViolationResetType                           \
        ROM_SysCtl_setWDTPasswordViolationResetType
#else
#define MAP_SysCtl_setWDTPasswordViolationResetType                           \
        SysCtl_setWDTPasswordViolationResetType
#endif
#ifdef ROM_SysCtl_disableNMISource
#define MAP_SysCtl_disableNMISource                                           \
        ROM_SysCtl_disableNMISource
#else
#define MAP_SysCtl_disableNMISource                                           \
        SysCtl_disableNMISource
#endif
#ifdef ROM_SysCtl_enableNMISource
#define MAP_SysCtl_enableNMISource                                            \
        ROM_SysCtl_enableNMISource
#else
#define MAP_SysCtl_enableNMISource                                            \
        SysCtl_enableNMISource
#endif
#ifdef ROM_SysCtl_getNMISourceStatus
#define MAP_SysCtl_getNMISourceStatus                                         \
        ROM_SysCtl_getNMISourceStatus
#else
#define MAP_SysCtl_getNMISourceStatus                                         \
        SysCtl_getNMISourceStatus
#endif
#ifdef ROM_SysCtl_getTempCalibrationConstant
#define MAP_SysCtl_getTempCalibrationConstant                                 \
        ROM_SysCtl_getTempCalibrationConstant
#else
#define MAP_SysCtl_getTempCalibrationConstant                                 \
        SysCtl_getTempCalibrationConstant
#endif
#ifdef ROM_SysCtl_enableGlitchFilter
#define MAP_SysCtl_enableGlitchFilter                                         \
        ROM_SysCtl_enableGlitchFilter
#else
#define MAP_SysCtl_enableGlitchFilter                                         \
        SysCtl_enableGlitchFilter
#endif
#ifdef ROM_SysCtl_disableGlitchFilter
#define MAP_SysCtl_disableGlitchFilter                                        \
        ROM_SysCtl_disableGlitchFilter
#else
#define MAP_SysCtl_disableGlitchFilter                                        \
        SysCtl_disableGlitchFilter
#endif
#ifdef ROM_SysCtl_getTLVInfo
#define MAP_SysCtl_getTLVInfo                                                 \
        ROM_SysCtl_getTLVInfo
#else
#define MAP_SysCtl_getTLVInfo                                                 \
        SysCtl_getTLVInfo
#endif

//*****************************************************************************
//
// Macros for the SysTick API.
//
//*****************************************************************************
#ifdef ROM_SysTick_enableModule
#define MAP_SysTick_enableModule                                              \
        ROM_SysTick_enableModule
#else
#define MAP_SysTick_enableModule                                              \
        SysTick_enableModule
#endif
#ifdef ROM_SysTick_disableModule
#define MAP_SysTick_disableModule                                             \
        ROM_SysTick_disableModule
#else
#define MAP_SysTick_disableModule                                             \
        SysTick_disableModule
#endif
#ifdef ROM_SysTick_enableInterrupt
#define MAP_SysTick_enableInterrupt                                           \
        ROM_SysTick_enableInterrupt
#else
#define MAP_SysTick_enableInterrupt                                           \
        SysTick_enableInterrupt
#endif
#ifdef ROM_SysTick_disableInterrupt
#define MAP_SysTick_disableInterrupt                                          \
        ROM_SysTick_disableInterrupt
#else
#define MAP_SysTick_disableInterrupt                                          \
        SysTick_disableInterrupt
#endif
#ifdef ROM_SysTick_setPeriod
#define MAP_SysTick_setPeriod                                                 \
        ROM_SysTick_setPeriod
#else
#define MAP_SysTick_setPeriod                                                 \
        SysTick_setPeriod
#endif
#ifdef ROM_SysTick_getPeriod
#define MAP_SysTick_getPeriod                                                 \
        ROM_SysTick_getPeriod
#else
#define MAP_SysTick_getPeriod                                                 \
        SysTick_getPeriod
#endif
#ifdef ROM_SysTick_getValue
#define MAP_SysTick_getValue                                                  \
        ROM_SysTick_getValue
#else
#define MAP_SysTick_getValue                                                  \
        SysTick_getValue
#endif
#ifdef ROM_SysTick_registerInterrupt
#define MAP_SysTick_registerInterrupt                                         \
        ROM_SysTick_registerInterrupt
#else
#define MAP_SysTick_registerInterrupt                                         \
        SysTick_registerInterrupt
#endif
#ifdef ROM_SysTick_unregisterInterrupt
#define MAP_SysTick_unregisterInterrupt                                       \
        ROM_SysTick_unregisterInterrupt
#else
#define MAP_SysTick_unregisterInterrupt                                       \
        SysTick_unregisterInterrupt
#endif

