arduino/Arduino/hardware/msp432/cores/msp432/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the Timer_A API.
//
//*****************************************************************************
#ifdef ROM_Timer_A_startCounter
#define MAP_Timer_A_startCounter                                              \
        ROM_Timer_A_startCounter
#else
#define MAP_Timer_A_startCounter                                              \
        Timer_A_startCounter
#endif
#ifdef ROM_Timer_A_configureContinuousMode
#define MAP_Timer_A_configureContinuousMode                                   \
        ROM_Timer_A_configureContinuousMode
#else
#define MAP_Timer_A_configureContinuousMode                                   \
        Timer_A_configureContinuousMode
#endif
#ifdef ROM_Timer_A_configureUpMode
#define MAP_Timer_A_configureUpMode                                           \
        ROM_Timer_A_configureUpMode
#else
#define MAP_Timer_A_configureUpMode                                           \
        Timer_A_configureUpMode
#endif
#ifdef ROM_Timer_A_configureUpDownMode
#define MAP_Timer_A_configureUpDownMode                                       \
        ROM_Timer_A_configureUpDownMode
#else
#define MAP_Timer_A_configureUpDownMode                                       \
        Timer_A_configureUpDownMode
#endif
#ifdef ROM_Timer_A_initCapture
#define MAP_Timer_A_initCapture                                               \
        ROM_Timer_A_initCapture
#else
#define MAP_Timer_A_initCapture                                               \
        Timer_A_initCapture
#endif
#ifdef ROM_Timer_A_initCompare
#define MAP_Timer_A_initCompare                                               \
        ROM_Timer_A_initCompare
#else
#define MAP_Timer_A_initCompare                                               \
        Timer_A_initCompare
#endif
#ifdef ROM_Timer_A_clearTimer
#define MAP_Timer_A_clearTimer                                                \
        ROM_Timer_A_clearTimer
#else
#define MAP_Timer_A_clearTimer                                                \
        Timer_A_clearTimer
#endif
#ifdef ROM_Timer_A_getSynchronizedCaptureCompareInput
#define MAP_Timer_A_getSynchronizedCaptureCompareInput                        \
        ROM_Timer_A_getSynchronizedCaptureCompareInput
#else
#define MAP_Timer_A_getSynchronizedCaptureCompareInput                        \
        Timer_A_getSynchronizedCaptureCompareInput
#endif
#ifdef ROM_Timer_A_getOutputForOutputModeOutBitValue
#define MAP_Timer_A_getOutputForOutputModeOutBitValue                         \
        ROM_Timer_A_getOutputForOutputModeOutBitValue
#else
#define MAP_Timer_A_getOutputForOutputModeOutBitValue                         \
        Timer_A_getOutputForOutputModeOutBitValue
#endif
#ifdef ROM_Timer_A_getCaptureCompareCount
#define MAP_Timer_A_getCaptureCompareCount                                    \
        ROM_Timer_A_getCaptureCompareCount
#else
#define MAP_Timer_A_getCaptureCompareCount                                    \
        Timer_A_getCaptureCompareCount
#endif
#ifdef ROM_Timer_A_setOutputForOutputModeOutBitValue
#define MAP_Timer_A_setOutputForOutputModeOutBitValue                         \
        ROM_Timer_A_setOutputForOutputModeOutBitValue
#else
#define MAP_Timer_A_setOutputForOutputModeOutBitValue                         \
        Timer_A_setOutputForOutputModeOutBitValue
#endif
#ifdef ROM_Timer_A_generatePWM
#define MAP_Timer_A_generatePWM                                               \
        ROM_Timer_A_generatePWM
#else
#define MAP_Timer_A_generatePWM                                               \
        Timer_A_generatePWM
#endif
#ifdef ROM_Timer_A_stopTimer
#define MAP_Timer_A_stopTimer                                                 \
        ROM_Timer_A_stopTimer
#else
#define MAP_Timer_A_stopTimer                                                 \
        Timer_A_stopTimer
#endif
#ifdef ROM_Timer_A_setCompareValue
#define MAP_Timer_A_setCompareValue                                           \
        ROM_Timer_A_setCompareValue
#else
#define MAP_Timer_A_setCompareValue                                           \
        Timer_A_setCompareValue
#endif
#ifdef ROM_Timer_A_clearInterruptFlag
#define MAP_Timer_A_clearInterruptFlag                                        \
        ROM_Timer_A_clearInterruptFlag
#else
#define MAP_Timer_A_clearInterruptFlag                                        \
        Timer_A_clearInterruptFlag
#endif
#ifdef ROM_Timer_A_clearCaptureCompareInterrupt
#define MAP_Timer_A_clearCaptureCompareInterrupt                              \
        ROM_Timer_A_clearCaptureCompareInterrupt
#else
#define MAP_Timer_A_clearCaptureCompareInterrupt                              \
        Timer_A_clearCaptureCompareInterrupt
#endif
#ifdef ROM_Timer_A_enableInterrupt
#define MAP_Timer_A_enableInterrupt                                           \
        ROM_Timer_A_enableInterrupt
#else
#define MAP_Timer_A_enableInterrupt                                           \
        Timer_A_enableInterrupt
#endif
#ifdef ROM_Timer_A_disableInterrupt
#define MAP_Timer_A_disableInterrupt                                          \
        ROM_Timer_A_disableInterrupt
#else
#define MAP_Timer_A_disableInterrupt                                          \
        Timer_A_disableInterrupt
#endif
#ifdef ROM_Timer_A_getInterruptStatus
#define MAP_Timer_A_getInterruptStatus                                        \
        ROM_Timer_A_getInterruptStatus
#else
#define MAP_Timer_A_getInterruptStatus                                        \
        Timer_A_getInterruptStatus
#endif
#ifdef ROM_Timer_A_getEnabledInterruptStatus
#define MAP_Timer_A_getEnabledInterruptStatus                                 \
        ROM_Timer_A_getEnabledInterruptStatus
#else
#define MAP_Timer_A_getEnabledInterruptStatus                                 \
        Timer_A_getEnabledInterruptStatus
#endif
#ifdef ROM_Timer_A_enableCaptureCompareInterrupt
#define MAP_Timer_A_enableCaptureCompareInterrupt                             \
        ROM_Timer_A_enableCaptureCompareInterrupt
#else
#define MAP_Timer_A_enableCaptureCompareInterrupt                             \
        Timer_A_enableCaptureCompareInterrupt
#endif
#ifdef ROM_Timer_A_disableCaptureCompareInterrupt
#define MAP_Timer_A_disableCaptureCompareInterrupt                            \
        ROM_Timer_A_disableCaptureCompareInterrupt
#else
#define MAP_Timer_A_disableCaptureCompareInterrupt                            \
        Timer_A_disableCaptureCompareInterrupt
#endif
#ifdef ROM_Timer_A_getCaptureCompareInterruptStatus
#define MAP_Timer_A_getCaptureCompareInterruptStatus                          \
        ROM_Timer_A_getCaptureCompareInterruptStatus
#else
#define MAP_Timer_A_getCaptureCompareInterruptStatus                          \
        Timer_A_getCaptureCompareInterruptStatus
#endif
#ifdef ROM_Timer_A_getCaptureCompareEnabledInterruptStatus
#define MAP_Timer_A_getCaptureCompareEnabledInterruptStatus                   \
        ROM_Timer_A_getCaptureCompareEnabledInterruptStatus
#else
#define MAP_Timer_A_getCaptureCompareEnabledInterruptStatus                   \
        Timer_A_getCaptureCompareEnabledInterruptStatus
#endif
#ifdef ROM_Timer_A_registerInterrupt
#define MAP_Timer_A_registerInterrupt                                         \
        ROM_Timer_A_registerInterrupt
#else
#define MAP_Timer_A_registerInterrupt                                         \
        Timer_A_registerInterrupt
#endif
#ifdef ROM_Timer_A_unregisterInterrupt
#define MAP_Timer_A_unregisterInterrupt                                       \
        ROM_Timer_A_unregisterInterrupt
#else
#define MAP_Timer_A_unregisterInterrupt                                       \
        Timer_A_unregisterInterrupt
#endif
#ifdef ROM_Timer_A_getCounterValue
#define MAP_Timer_A_getCounterValue                                           \
        ROM_Timer_A_getCounterValue
#else
#define MAP_Timer_A_getCounterValue                                           \
        Timer_A_getCounterValue
#endif

//*****************************************************************************
//
// Macros for the Timer32 API.
//
//*****************************************************************************
#ifdef ROM_Timer32_initModule
#define MAP_Timer32_initModule                                                \
        ROM_Timer32_initModule
#else
#define MAP_Timer32_initModule                                                \
        Timer32_initModule
#endif
#ifdef ROM_Timer32_setCount
#define MAP_Timer32_setCount                                                  \
        ROM_Timer32_setCount
#else
#define MAP_Timer32_setCount                                                  \
        Timer32_setCount
#endif
#ifdef ROM_Timer32_setCountInBackground
#define MAP_Timer32_setCountInBackground                                      \
        ROM_Timer32_setCountInBackground
#else
#define MAP_Timer32_setCountInBackground                                      \
        Timer32_setCountInBackground
#endif
#ifdef ROM_Timer32_getValue
#define MAP_Timer32_getValue                                                  \
        ROM_Timer32_getValue
#else
#define MAP_Timer32_getValue                                                  \
        Timer32_getValue
#endif
#ifdef ROM_Timer32_startTimer
#define MAP_Timer32_startTimer                                                \
        ROM_Timer32_startTimer
#else
#define MAP_Timer32_startTimer                                                \
        Timer32_startTimer
#endif
#ifdef ROM_Timer32_haltTimer
#define MAP_Timer32_haltTimer                                                 \
        ROM_Timer32_haltTimer
#else
#define MAP_Timer32_haltTimer                                                 \
        Timer32_haltTimer
#endif
#ifdef ROM_Timer32_enableInterrupt
#define MAP_Timer32_enableInterrupt                                           \
        ROM_Timer32_enableInterrupt
#else
#define MAP_Timer32_enableInterrupt                                           \
        Timer32_enableInterrupt
#endif
#ifdef ROM_Timer32_disableInterrupt
#define MAP_Timer32_disableInterrupt                                          \
        ROM_Timer32_disableInterrupt
#else
#define MAP_Timer32_disableInterrupt                                          \
        Timer32_disableInterrupt
#endif
#ifdef ROM_Timer32_clearInterruptFlag
#define MAP_Timer32_clearInterruptFlag                                        \
        ROM_Timer32_clearInterruptFlag
#else
#define MAP_Timer32_clearInterruptFlag                                        \
        Timer32_clearInterruptFlag
#endif
#ifdef ROM_Timer32_getInterruptStatus
#define MAP_Timer32_getInterruptStatus                                        \
        ROM_Timer32_getInterruptStatus
#else
#define MAP_Timer32_getInterruptStatus                                        \
        Timer32_getInterruptStatus
#endif
#ifdef ROM_Timer32_registerInterrupt
#define MAP_Timer32_registerInterrupt                                         \
        ROM_Timer32_registerInterrupt
#else
#define MAP_Timer32_registerInterrupt                                         \
        Timer32_registerInterrupt
#endif
#ifdef ROM_Timer32_unregisterInterrupt
#define MAP_Timer32_unregisterInterrupt                                       \
        ROM_Timer32_unregisterInterrupt
#else
#define MAP_Timer32_unregisterInterrupt                                       \
        Timer32_unregisterInterrupt
#endif

//*****************************************************************************
//
// Macros for the UART API.
//
//*****************************************************************************
#ifdef ROM_UART_initModule
#define MAP_UART_initModule                                                   \
        ROM_UART_initModule
#else
#define MAP_UART_initModule                                                   \
        UART_initModule
#endif
#ifdef ROM_UART_transmitData
#define MAP_UART_transmitData                                                 \
        ROM_UART_transmitData
#else
#define MAP_UART_transmitData                                                 \
        UART_transmitData
#endif
#ifdef ROM_UART_enableModule
#define MAP_UART_enableModule                                                 \
        ROM_UART_enableModule
#else
#define MAP_UART_enableModule                                                 \
        UART_enableModule
#endif
#ifdef ROM_UART_disableModule
#define MAP_UART_disableModule                                                \
        ROM_UART_disableModule
#else
#define MAP_UART_disableModule                                                \
        UART_disableModule
#endif
#ifdef ROM_UART_queryStatusFlags
#define MAP_UART_queryStatusFlags                                             \
        ROM_UART_queryStatusFlags
#else
#define MAP_UART_queryStatusFlags                                             \
        UART_queryStatusFlags
#endif
#ifdef ROM_UART_setDormant
#define MAP_UART_setDormant                                                   \
        ROM_UART_setDormant
#else
#define MAP_UART_setDormant                                                   \
        UART_setDormant
#endif
#ifdef ROM_UART_resetDormant
#define MAP_UART_resetDormant                                                 \
        ROM_UART_resetDormant
#else
#define MAP_UART_resetDormant                                                 \
        UART_resetDormant
#endif
#ifdef ROM_UART_transmitAddress
#define MAP_UART_transmitAddress                                              \
        ROM_UART_transmitAddress
#else
#define MAP_UART_transmitAddress                                              \
        UART_transmitAddress
#endif
#ifdef ROM_UART_transmitBreak
#define MAP_UART_transmitBreak                                                \
        ROM_UART_transmitBreak
#else
#define MAP_UART_transmitBreak                                                \
        UART_transmitBreak
#endif
#ifdef ROM_UART_getReceiveBufferAddressForDMA
#define MAP_UART_getReceiveBufferAddressForDMA                                \
        ROM_UART_getReceiveBufferAddressForDMA
#else
#define MAP_UART_getReceiveBufferAddressForDMA                                \
        UART_getReceiveBufferAddressForDMA
#endif
#ifdef ROM_UART_getTransmitBufferAddressForDMA
#define MAP_UART_getTransmitBufferAddressForDMA                               \
        ROM_UART_getTransmitBufferAddressForDMA
#else
#define MAP_UART_getTransmitBufferAddressForDMA                               \
        UART_getTransmitBufferAddressForDMA
#endif
#ifdef ROM_UART_selectDeglitchTime
#define MAP_UART_selectDeglitchTime                                           \
        ROM_UART_selectDeglitchTime
#else
#define MAP_UART_selectDeglitchTime                                           \
        UART_selectDeglitchTime
#endif
#ifdef ROM_UART_enableInterrupt
#define MAP_UART_enableInterrupt                                              \
        ROM_UART_enableInterrupt
#else
#define MAP_UART_enableInterrupt                                              \
        UART_enableInterrupt
#endif
#ifdef ROM_UART_disableInterrupt
#define MAP_UART_disableInterrupt                                             \
        ROM_UART_disableInterrupt
#else
#define MAP_UART_disableInterrupt                                             \
        UART_disableInterrupt
#endif
#ifdef ROM_UART_getInterruptStatus
#define MAP_UART_getInterruptStatus                                           \
        ROM_UART_getInterruptStatus
#else
#define MAP_UART_getInterruptStatus                                           \
        UART_getInterruptStatus
#endif
#ifdef ROM_UART_clearInterruptFlag
#define MAP_UART_clearInterruptFlag                                           \
        ROM_UART_clearInterruptFlag
#else
#define MAP_UART_clearInterruptFlag                                           \
        UART_clearInterruptFlag
#endif
#ifdef ROM_UART_receiveData
#define MAP_UART_receiveData                                                  \
        ROM_UART_receiveData
#else
#define MAP_UART_receiveData                                                  \
        UART_receiveData
#endif
#ifdef ROM_UART_getEnabledInterruptStatus
#define MAP_UART_getEnabledInterruptStatus                                    \
        ROM_UART_getEnabledInterruptStatus
#else
#define MAP_UART_getEnabledInterruptStatus                                    \
        UART_getEnabledInterruptStatus
#endif
#ifdef ROM_UART_registerInterrupt
#define MAP_UART_registerInterrupt                                            \
        ROM_UART_registerInterrupt
#else
#define MAP_UART_registerInterrupt                                            \
        UART_registerInterrupt
#endif
#ifdef ROM_UART_unregisterInterrupt
#define MAP_UART_unregisterInterrupt                                          \
        ROM_UART_unregisterInterrupt
#else
#define MAP_UART_unregisterInterrupt                                          \
        UART_unregisterInterrupt
#endif

//*****************************************************************************
//
// Macros for the WDT API.
//
//*****************************************************************************
#ifdef ROM_WDT_A_holdTimer
#define MAP_WDT_A_holdTimer                                                   \
        ROM_WDT_A_holdTimer
#else
#define MAP_WDT_A_holdTimer                                                   \
        WDT_A_holdTimer
#endif
#ifdef ROM_WDT_A_startTimer
#define MAP_WDT_A_startTimer                                                  \
        ROM_WDT_A_startTimer
#else
#define MAP_WDT_A_startTimer                                                  \
        WDT_A_startTimer
#endif
#ifdef ROM_WDT_A_clearTimer
#define MAP_WDT_A_clearTimer                                                  \
        ROM_WDT_A_clearTimer
#else
#define MAP_WDT_A_clearTimer                                                  \
        WDT_A_clearTimer
#endif
#ifdef ROM_WDT_A_initWatchdogTimer
#define MAP_WDT_A_initWatchdogTimer                                           \
        ROM_WDT_A_initWatchdogTimer
#else
#define MAP_WDT_A_initWatchdogTimer                                           \
        WDT_A_initWatchdogTimer
#endif
#ifdef ROM_WDT_A_initIntervalTimer
#define MAP_WDT_A_initIntervalTimer                                           \
        ROM_WDT_A_initIntervalTimer
#else
#define MAP_WDT_A_initIntervalTimer                                           \
        WDT_A_initIntervalTimer
#endif
#ifdef ROM_WDT_A_registerInterrupt
#define MAP_WDT_A_registerInterrupt                                           \
        ROM_WDT_A_registerInterrupt
#else
#define MAP_WDT_A_registerInterrupt                                           \
        WDT_A_registerInterrupt
#endif
#ifdef ROM_WDT_A_unregisterInterrupt
#define MAP_WDT_A_unregisterInterrupt                                         \
        ROM_WDT_A_unregisterInterrupt
#else
#define MAP_WDT_A_unregisterInterrupt                                         \
        WDT_A_unregisterInterrupt
#endif
#ifdef ROM_WDT_A_setPasswordViolationReset
#define MAP_WDT_A_setPasswordViolationReset                                   \
        ROM_WDT_A_setPasswordViolationReset
#else
#define MAP_WDT_A_setPasswordViolationReset                                   \
        WDT_A_setPasswordViolationReset
#endif
#ifdef ROM_WDT_A_setTimeoutReset
#define MAP_WDT_A_setTimeoutReset                                             \
        ROM_WDT_A_setTimeoutReset
#else
#define MAP_WDT_A_setTimeoutReset                                             \
        WDT_A_setTimeoutReset
#endif

#endif // __ROM_MAP_H__
